artillery.yml
# Artillery Load Testing Configuration
# Run with: npx artillery run artillery.yml

config:
  target: "http://localhost:5173" # Change to production URL for prod tests
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"

    # Ramp up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"

    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"

    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"

    # Cool down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 10
      name: "Cool down"

  # Performance thresholds
  ensure:
    maxErrorRate: 1 # Max 1% error rate
    p95: 2000 # 95th percentile response time < 2000ms
    p99: 5000 # 99th percentile response time < 5000ms

  # HTTP configuration
  http:
    timeout: 10 # 10 second timeout

  # Variables (can be overridden with --variables flag)
  variables:
    testUserEmail: "loadtest@example.com"
    testUserPassword: "Test123!@#"

scenarios:
  # ==============================================
  # Scenario 1: Homepage Load
  # ==============================================
  - name: "Load Homepage"
    weight: 30 # 30% of traffic
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: text/html
          capture:
            - json: "$.title"
              as: "pageTitle"

  # ==============================================
  # Scenario 2: Static Assets
  # ==============================================
  - name: "Load Static Assets"
    weight: 20 # 20% of traffic
    flow:
      - get:
          url: "/assets/index.js"
          expect:
            - statusCode: [200, 304] # OK or Not Modified

  # ==============================================
  # Scenario 3: API Health Check
  # ==============================================
  - name: "API Health Check"
    weight: 10 # 10% of traffic
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: [200, 404] # OK or Not Found (if not implemented)

  # ==============================================
  # Scenario 4: Dashboard Load (Authenticated)
  # ==============================================
  - name: "Load Dashboard"
    weight: 20 # 20% of traffic
    flow:
      # Step 1: Navigate to login page
      - get:
          url: "/login"
          expect:
            - statusCode: 200

      # Step 2: Submit login (mock)
      # Note: In production, you'd need valid auth tokens
      - post:
          url: "/auth/login"
          json:
            email: "{{ testUserEmail }}"
            password: "{{ testUserPassword }}"
          expect:
            - statusCode: [200, 401, 404] # Accept various responses for mock testing
          capture:
            - json: "$.token"
              as: "authToken"
              strict: false # Don't fail if token not present

      # Step 3: Load dashboard (if auth successful)
      - get:
          url: "/dashboard"
          expect:
            - statusCode: [200, 302, 401] # OK, Redirect, or Unauthorized

  # ==============================================
  # Scenario 5: Canvas Sync Simulation
  # ==============================================
  - name: "Canvas Sync Load"
    weight: 10 # 10% of traffic
    flow:
      # Simulate multiple users syncing Canvas data simultaneously
      - get:
          url: "/dashboard/academics"
          expect:
            - statusCode: [200, 302, 401]

      # Trigger sync (mock)
      - post:
          url: "/api/canvas/sync"
          json:
            userId: "{{ $randomString() }}"
          expect:
            - statusCode: [200, 401, 404, 500] # Various responses

  # ==============================================
  # Scenario 6: Database Query Load
  # ==============================================
  - name: "Database Query Load"
    weight: 10 # 10% of traffic
    flow:
      # Simulate heavy database queries
      - get:
          url: "/api/grades"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/assignments"
          expect:
            - statusCode: [200, 401, 404]

      - get:
          url: "/api/classes"
          expect:
            - statusCode: [200, 401, 404]

# ==============================================
# Plugins (optional)
# ==============================================
plugins:
  expect: {} # Enable expect plugin for assertions
  metrics-by-endpoint: {} # Track metrics per endpoint

# ==============================================
# Reporting
# ==============================================
# Run with: npx artillery run artillery.yml --output report.json
# Generate HTML report: npx artillery report report.json